Code/ExceptionExample/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSSE 375 Exception Example: Backup System</title>
<!-- 2015-05-18 Mon 08:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />
</head>
<body>
<div id="content">
<h1 class="title">CSSE 375 Exception Example: Backup System</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. The Problem</a></li>
<li><a href="#sec-3">3. Getting started</a></li>
<li><a href="#sec-4">4. Clean Up The Code in BackupSystem</a></li>
<li><a href="#sec-5">5. Add a new feature</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The code for this assignment should be in your SVN.
</p>

<p>
So this code is meant to represent a very simple file backup system.
The idea is that we want to backup lists of files, but these files may
need to be backed up to different locations.  Everything is meant to
be controlled by so-called file manifests.  These are files that
contain what needs to be backed up where.  They look like this:
</p>

<pre class="example">
FILE coolFile.txt /home/buffalo/sourceDir /backupDir
FILE otherFile.txt /home/buffalo/otherDir /secretEncryptedBackupDir
MANIFEST secretProject.txt
</pre>

<p>
The first two lines just configure two files (filename sourceDir backupDir).
</p>

<p>
The 3rd line provides a link to another manifest.  One manifest may
include several other sub-manifests that all need to get backed up.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Problem</h2>
<div class="outline-text-2" id="text-2">
<p>
Like most things involving files, there are a lot of possible error
cases in this system.  We'll think about 3:
</p>

<ul class="org-ul">
<li>The file needs to exist
</li>
<li>The backup directory needs to exist
</li>
<li>The file should NOT already exist in the backup directory
</li>
</ul>

<p>
The code already handles these cases, but unfortunately it does not
use exceptions.  This makes the code filled with random print messages
and weird error handling (that can easily be forgotten):
</p>

<p>
Here's some examples in BackupSystem.java
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #6434A3;">boolean</span> <span style="color: #006699;">parseManifest</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">filename</span>) {
        <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">contents</span> = fs.getFileContents(filename);
        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">lines</span> = contents.split(<span style="color: #008000;">"\n"</span>);
        <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">line</span> : lines) {
                <span style="color: #0000FF;">if</span>(line.startsWith(<span style="color: #008000;">"FILE"</span>)) {
                        <span style="color: #0000FF;">if</span>(<span style="color: #F0DFAF; font-weight: bold;">!</span>parseFileLine(line)) {
                                System.err.println(<span style="color: #008000;">"error reading file line!"</span>);
                                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">false</span>;

                        }
                } <span style="color: #0000FF;">else</span> <span style="color: #0000FF;">if</span>(line.startsWith(<span style="color: #008000;">"MANIFEST"</span>)) {
                        <span style="color: #0000FF;">if</span>(<span style="color: #F0DFAF; font-weight: bold;">!</span>parseManifestLine(line)) {
                                System.err.println(<span style="color: #008000;">"error reading manifest line"</span>);
                                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">false</span>;
                        }
                } <span style="color: #0000FF;">else</span> {
                        System.err.println(<span style="color: #008000;">"Bad unknown line!"</span>);
                }
        }
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">true</span>;
}

<span style="color: #0000FF;">private</span> <span style="color: #6434A3;">boolean</span> <span style="color: #006699;">parseFileLine</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">line</span>) {
        <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">parts</span> = line.split(<span style="color: #008000;">" "</span>);
        <span style="color: #6434A3;">BackupLink</span> <span style="color: #BA36A5;">newLink</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">BackupLink</span>(<span style="color: #0000FF;">this</span>.fs);
        <span style="color: #0000FF;">if</span>(<span style="color: #F0DFAF; font-weight: bold;">!</span>newLink.setSource(parts[1], parts[2])) {
                System.err.println(<span style="color: #008000;">"Error setting source!"</span>);
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">false</span>;
        }
        <span style="color: #0000FF;">if</span>(<span style="color: #F0DFAF; font-weight: bold;">!</span>newLink.setBackupDestination(parts[3])) {
                System.err.println(<span style="color: #008000;">"Error setting backup destination!"</span>);
                <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">false</span>;
        }
        backups.add(newLink);
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">true</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Getting started</h2>
<div class="outline-text-2" id="text-3">
<p>
Start by looking at [<a href="src/backups/BackupLink.java">src/backups/BackupLink.java</a>] - this is the code that actually
checks for the 3 error conditions.
</p>

<p>
Modify this code so that it throws exceptions rather than returns
false in bad situations.  Define your own exception type that the functions throw.
</p>

<p>
You'll also need to modify the unit tests in TestBackupLink (but I've
provided some example code there).
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Clean Up The Code in BackupSystem</h2>
<div class="outline-text-2" id="text-4">
<p>
Now that BackupLink uses exceptions, it should be easy to clean up the
functions above.  
</p>

<p>
Keep parseManifest returning a boolean (not throwing
an exception) &#x2013; we'll keep the external interface the same.
parseManifest should catch all exceptions, print what happened to
System.err, and then return false (and not attempt to continue the
parse).
</p>

<p>
This means that we should probably change parseManifestLine so that it
calls a utility function rather than parseManifest directly.
Otherwise you may have some troubles because some of the recursive
calls to parseManifest will eat exceptions otherwise.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Add a new feature</h2>
<div class="outline-text-2" id="text-5">
<p>
One tricky thing that can happen in this system is an erroneous FILE
line aborts the whole processing, but figuring out what manifest the
problematic line is from can be difficult.  Modify the code so that
the exception thrown somehow includes the manifest file it was a part
of.  To make this interesting, do it without modifying the signatures
of the functions of BackupLink - somehow encode it in the global
state.
</p>

<p>
To make things even more interesting, ensure that this global state is
always correct, even when an exception is thrown.  This means you'll
have to use finally blocks to reset the state as the exception moves up
the call stack.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2015-05-18 Mon 08:43</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
